#include "time1.h"


/*******************************************************************
********************************************************************
* 名称：   tim1 ch3 的pwm调制 ，可控占空和周期
* 功能：
* 参数：  psc ：预分频值 （168M） arr: 重装载值 =100   Compare ：比较值（调整占空比）
* 返回值：
* 版本：
* 作者：matt
* 日期：2018-8
* arr*psc /168M =周期 ， (  Compare< arr )：决定在这个周期里，高电平占用的时间
*  有点问题？？？？？？
*********************************************************************
*********************************************************************/ 
void Timer1_Ch3_Output_PWM(u16 psc,u16 arr,u16 Compare)
{
    //  1 因为要用到GPIO 使能时钟
    //【RCC_AHB1ENR】-----------------------------------------------------------
    // BIT0   BIT1  BIT2   BIT3   BIT4  BIT5   BIT6   BIT7   BIT8
    //GPIOA  GPIOB GPIOC GPIOD  GPIOE  GPIOF  GPIOG  GPIOH  GPIOI 
    //【RCC_APB1ENR】-----------------------------------------------------------
    //BIT0   BIT1  BIT2   BIT3   BIT4  BIT5   BIT6   BIT7     BIT8    BIT11  BIT14  BIT15
    //TIM2   TIM3  TIM4   TIM5   TIM6  TIM7   TIM12   TIM13   TIM14   WWDG   SPI2   SPI3
    //-----------------------------------------------------------
	//BIT17    BIT18   BIT19   BIT20   BIT21   BIT22   BIT23   BIT25  BIT26  BIT28  BIT29
	//usart2   usart3  usart4  usart5  iic1    iic2    iic3    can1   can2   pwr    DAC      
	//  2 模式选择 00：输入（默认） 【01：通用输出】 10：复用  11：模拟
	//  3 输出类型选择  0：推挽输出  【1：开漏输出】
	
	//  4 输出速度选择  【00:2M 】  01:25M    10:50M    11:80-100M
		
    //  5 上 下拉选择   【00：无】  01：上拉  10：下拉  11：保留
    	
	//初始化IO口(PB15--复用功能的推挽输出)
	//1.端口B时钟使能 //PB15 
	RCC->AHB1ENR |=(1<<1);
	//2.配置复用功能输出模式（MODER寄存器）
	GPIOB->MODER &=~(3<<30);//清零
	GPIOB->MODER |=(2<<30);	
	//3.配置成推挽输出（OTYPER寄存器）
	GPIOB->OTYPER &=~(1<<15);
	//4.配置输出速度，（OSPEEDR寄存器）
	GPIOB->OSPEEDR &=~(3<<30);
	GPIOB->OSPEEDR |= (3<<30);
	//5.配置成无上拉无下拉(浮空)（PUPDR寄存器）
	GPIOB->PUPDR &=~(3<<30);
	//复用成TIMER1_CH3
	GPIOB->AFR[1] &=~(0x0f<<28);
	GPIOB->AFR[1] |=(0x01<<28);
	
	//定时器1时钟使能
	RCC->APB2ENR |=(1<<0);
//	选择内部时钟源
	TIM1->SMCR &=~(1<<14);  //禁止外部时钟模式 2
	TIM1->SMCR &=~(7<<0);
//	配置基本定时器功能（让计数器正常工作
	//设置CR1
	TIM1->CR1 =0;
	//设定分频值（PSC）
	TIM1->PSC =psc-1;
	//设定重装载值（ARR）
	TIM1->ARR =arr-1;
	//计数值清零
	TIM1->CNT =0;
	
//	配置通用定时器比较输出功能
	TIM1->CCR3=Compare;
	
	TIM1->CCMR2 &=~(3<<0);//CC3 通道配置为输出
	
	TIM1->CCMR2 &=~(1<<3);//比较寄存器不缓冲
	
	TIM1->CCMR2 &=~(7<<4); //PWM 模式 1–– 在递增计数模式下，
	                          //只要 TIMx_CNT<TIMx_CCR1，通道 1 便为有效状态，否则为无效状态
	TIM1->CCMR2|=(6<<4);//PWM1模式
	
	TIM1->CCER &=~(1<<9); //OC3  高电平有效
	TIM1->CCMR2 &=~(1<<7);//OC3  Ref 不受 ETRF 输入影响
	
	TIM1->CCER |=(1<<8); // OC3开启––在相应输出引脚上输出 OC3 信号
	
	TIM1->EGR |=(1<<0);  //生成一次更新事件，好更新上述设置的值
	TIM1->SR &=~(1<<0);//清除标志
	while(TIM1->SR&(1<<0));  //等待更新标志清除完毕
	TIM1->CR1 |=1<<0;//开启tim1 计数器
}



